#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
terraform
Acquiring state lock. This may take a few moments...
openstack_networking_floatingip_v2.fip: Refreshing state... [id=c9748d9d-b5db-4a45-98c3-42bf7d990d96]
data.openstack_images_image_v2.egi-docker: Reading...
openstack_compute_secgroup_v2.motley-cloud-info-api: Refreshing state... [id=2b924426-2a44-4b78-9668-7c80a62a6ee9]
openstack_compute_secgroup_v2.secgroup: Refreshing state... [id=64a5984e-7690-439d-ad72-f3b8e9a08249]
data.openstack_images_image_v2.egi-docker: Read complete after 2s [id=8c193dbd-841f-47ab-8247-e579e7e4a27e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # openstack_compute_floatingip_associate_v2.fip will be created
  + resource "openstack_compute_floatingip_associate_v2" "fip" {
      + floating_ip = "147.213.76.180"
      + id          = (known after apply)
      + instance_id = (known after apply)
      + region      = (known after apply)
    }

  # openstack_compute_instance_v2.cloud-info-api will be created
  + resource "openstack_compute_instance_v2" "cloud-info-api" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + created             = (known after apply)
      + flavor_id           = "df25f80f-ed19-4e0b-805e-d34620ba0334"
      + flavor_name         = (known after apply)
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = "8c193dbd-841f-47ab-8247-e579e7e4a27e"
      + image_name          = (known after apply)
      + name                = "cloud-info-api"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "HTTP-cloud-info-api",
          + "motley-cue-cloud-info-api",
        ]
      + stop_before_destroy = false
      + updated             = (known after apply)
      + user_data           = "81446dc5075551f6d4fa0b6b9c38c12f07d88a51"

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = "d95ef0fe-bec9-4b90-ba34-a21204413098"
        }
    }

  # openstack_compute_secgroup_v2.motley-cloud-info-api will be created
  + resource "openstack_compute_secgroup_v2" "motley-cloud-info-api" {
      + description = "Open access via ssh-oidc"
      + id          = (known after apply)
      + name        = "motley-cue-cloud-info-api"
      + region      = (known after apply)

      + rule {
          + cidr        = "0.0.0.0/0"
          + from_port   = 22
          + id          = (known after apply)
          + ip_protocol = "tcp"
          + self        = false
          + to_port     = 22
        }
      + rule {
          + cidr        = "0.0.0.0/0"
          + from_port   = 8181
          + id          = (known after apply)
          + ip_protocol = "tcp"
          + self        = false
          + to_port     = 8181
        }
    }

  # openstack_compute_secgroup_v2.secgroup will be created
  + resource "openstack_compute_secgroup_v2" "secgroup" {
      + description = "HTTP and HTTPS access"
      + id          = (known after apply)
      + name        = "HTTP-cloud-info-api"
      + region      = (known after apply)

      + rule {
          + cidr        = "0.0.0.0/0"
          + from_port   = 443
          + id          = (known after apply)
          + ip_protocol = "tcp"
          + self        = false
          + to_port     = 443
        }
      + rule {
          + cidr        = "0.0.0.0/0"
          + from_port   = 80
          + id          = (known after apply)
          + ip_protocol = "tcp"
          + self        = false
          + to_port     = 80
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with provider["registry.terraform.io/terraform-provider-openstack/openstack"],
  on clouds.tf line 12, in provider "openstack":
  12: provider "openstack" {

Users not using loadbalancer resources can ignore this message. Support for
neutron-lbaas will be removed on next major release. Octavia will be the only
supported method for loadbalancer resources. Users using octavia will have to
remove 'use_octavia' option from the provider configuration block. Users
using neutron-lbaas will have to migrate/upgrade to octavia.

(and one more similar warning elsewhere)

Warning: Deprecated Resource

  with openstack_compute_secgroup_v2.secgroup,
  on main.tf line 12, in resource "openstack_compute_secgroup_v2" "secgroup":
  12: resource "openstack_compute_secgroup_v2" "secgroup" {

use openstack_networking_secgroup_v2 resource instead

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @enolfc, Action: `pull_request`*